app/controllers/users_controller.rb

	def show
		seshID =  session[:user_id].to_s
		id = params[:id].to_s
		if seshID == id
			@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]

	def create
		@user = User.new(user_params)
		@user.kill_code = generate_random_string
		if @user.save
			log_in @user
			flash[:success] = "Welcome to the time of your life!"
			@user.begin_game
			redirect_to @user

		elsif !@user.save && User.find_by(kill_code: @user.kill_code)
---
INSERT INTO "users" ("name", "email", "password_digest", "phone_number", "kill_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "target" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["target", "fake me"], ["updated_at", "2016-07-27 01:39:51.132942"], ["id", 1]]

	def delete

		id = params[:id]
		killCode = params[:users][:kill_code]
		currentUser = User.find_by(id: id)
		killedUser = User.find_by(kill_code: killCode)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."kill_code" = ? LIMIT 1  [["kill_code", "42"]]